/* Напишете функция, която извежда на конзолата номерата на стаите 
в една сграда (в низходящ ред), като са изпълнени следните условия:
• На всеки четен етаж има само офис
• На всеки нечетен етаж има само апартаменти
• Всеки апартамент се означава по следния начин: 
A{номер на етажа}{номер на апартамента}, номерата на апартаментите
започват от 0.
• Всеки офис се означава по следния начин: 
O{номер на етажа}{номер на офиса}, номерата на офисите също 
започват от 0.
• На последният етаж винаги има апартаменти и те са по-големи от 
останалите, за това пред номера им пише 'L', вместо 'A'. 
Ако има само един етаж, то има само големи апартаменти!
Функцията получава масив от две цели числа - броят на етажите
и броят на стаите за един етаж*/


function building(input) {
    let floorCount = Number(input[0]);
    let roomCount = Number(input[1]);

    for (let floor = floorCount; floor > 0; floor--) {
        let res = " ";
        for (let room = 0; room < roomCount; room++) {
            if (floor === floorCount) {
                res += ` L${floor}${room}`;
            } else if(floor % 2  !== 0) {
                res += ` A${floor}${room}`;
            } else{
                res += ` O${floor}${room}`;
            }
        } 
        console.log(res);
    }
}

building(["6", "4"]);
//building(["9", "5"]);
//building(["4", "4"]);

