/* Поканени сте на 30-ти рожден ден, на който рожденикът черпи с
огромна торта. Той обаче не знае колко парчета могат да си вземат
гостите от нея. Вашата задача е да напишете функция, която изчислява
броя на парчетата, които гостите са взели, преди тя да свърши.
Ще получите размерите на тортата (широчина и дължина – цели числа
в интервала [1...1000]) и след това на всеки ред, до получаване
на командата "STOP" или докато не свърши тортата, броят на 
парчетата, които гостите вземат от нея. 

Бележка: Едно парче торта е с размер 1х1 см.
Да се отпечата на конзолата един от следните редове:
• "{брой парчета} pieces are left." - ако стигнете до STOP и не 
са свършили парчетата торта
• "No more cake left! You need {брой недостигащи парчета} pieces 
more." */
function cake(input) {
    let index = 0;
    let width = Number(input[index]);
    index++;
    let length = Number(input[index]);
    index++;

    let pieceSize = width * length;
    let command = input[index]; // Number(input[index]);
    index++;

    while (command !== "STOP") {
        let pieceCake = Number(command);
        pieceSize -= pieceCake;
        if (pieceSize < 0) {
            break;
        }

        command = input[index];
        index++;
    }

    if (pieceSize >= 0) {
        console.log(`${pieceSize} pieces are left.`);
    } else {
        console.log(`No more cake left! You need ${Math.abs(pieceSize)} pieces more.`)
    }
}

cake(["10", "10", "20", "20", "20", "20", "21"]);
/* No more cake left! You need 1 pieces more.

Тортата е с дължина 10 и широчина 10
=> броят на парчетата = 10 * 10 = 100
1-во вземане -> 100 - 20 = 80
2-ро вземане -> 80 - 20 = 60
3-то вземане -> 60 - 20 = 40
4-то вземане -> 40 - 20 = 20
5-то вземане -> 20 - 21 = -1 < 0
=> не остава повече торта, 1 парче не 
достига  */

cake(["10", "2", "2", "4", "6", "STOP"]);
/* 8 pieces are left.
Тортата е с дължина 10 и широчина 2
=> броят на парчетата = 10 * 2 = 20
1-во вземане -> 20 - 2 = 18
2-ро вземане -> 18 - 4 = 14
3-то вземане -> 14 - 6 = 8
4-то вземане -> команда STOP
=>останали парчета: 8
 */